# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# --- [1] 核心命令行工具 (CLI Tools) ---
brew "git"
brew "gh"          # GitHub 命令行工具
brew "jq"          # JSON 解析工具 (查 IP 命令必须)
brew "curl"
brew 'mackup'
brew 'mas' # Mac App Store manager

# --- [2] 前端开发环境 (Frontend Stack) ---
brew "nvm"         # Node.js 版本管理
brew "pnpm"        # 现代包管理工具
brew 'yarn'

# --- [3] AI & 后端开发 (AI Full-Stack) ---
brew "python@3.11" # AI 库最兼容的 Python 版本
brew "uv"          # 必装：目前全球最快的 Python 包/环境管理 (取代 pip)
brew "ollama"      # 本地大模型运行引擎 (跑 DeepSeek 必备)
cask "orbstack"    # 必装：比 Docker Desktop 轻量 10 倍，完全兼容 Docker

# --- [4] 终端增强与皮肤 (Terminal Experience) ---
brew "starship"                # 极速终端提示符 (颜值担当)
brew "zsh-autosuggestions"     # 灰色历史命令补全
brew "zsh-syntax-highlighting" # 命令语法高亮
brew "fzf"                     # 模糊搜索神器 (Ctrl+R 找历史命令)
cask "font-jetbrainsmono-nerd-font" # 必装：解决终端图标乱码

# --- [5] 网络调试与测速 (Networking) ---
brew "speedtest-cli" # 命令行一键测速
brew "dog"           # 现代 DNS 查询 (取代 dig)
cask "wireshark"     # 网络抓包分析
cask "clash-verge-rev" # 代理工具

# --- [6] AI 专属 IDE 与开发工具 ---
cask "cursor"        # AI IDE 核心首选
cask "trae"          # 字节跳动出品 AI IDE
cask "visual-studio-code"
cask "postman"       # 接口调试
cask "balenaetcher"  # 启动盘制作工具

# --- [7] 顶级终端 (Terminals) ---
cask "iterm2"         

# --- [8] 系统增强与清理 ---
cask "cleanmymac"    # 系统清理
cask "stats"         # 菜单栏实时显示网速、CPU、内存 (强烈推荐)
cask "raycast"       # 替代 Spotlight 的神级工具，可集成 Claude/Gemini API

# --- [9] 社交、媒体与生活 ---
cask "wechat"

# Apps
cask 'discord'
cask 'docker'
cask 'github'
cask 'google-chrome'
cask 'tableplus'

